<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"c2d6e06fe245114710df5a6190e5fb5ac532f0be7b3ef98a06504bfccd1e35c7","plan_job_ref":"Job Test actions using target and replace #457 at https://github.com/dflook/terraform-github-actions/actions/runs/13548761048","plan_out_hash":"ead61b9f80cde0dc4b3837cbd5c04dfe4fb3598450e5a257802ff76a59444278","plan_hash":"ae7165eea29fb9e35ff675cf8248761e7e42c208a875f0258124ec4fff20a11d","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "KFZEC2bkLN" -> (known after apply)
!~  foreach = "MpgzwwHjO6" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #457](https://github.com/dflook/terraform-github-actions/actions/runs/13548761048)